Repository: enjaz/enjaz
Catalog: forms_builder/wrapper/locale/*/LC_MESSAGES/django.po
Languages: ar_sa

source: 1 entry deleted
ar_sa: تم حذف مدخل واحد

source: View Entries
ar_sa: اعرض المدخلات

source: Delete form
ar_sa: احذف النموذج

source: Are you sure you want to <strong>delete</strong> the form
ar_sa: هل أنت متأكد من أنك تريد <strong>حذف</strong> النموذج

source: Yes
ar_sa: نعم

source: No
ar_sa: لا

source: Edit Form
ar_sa: عدل النموذج

source: Add Form
ar_sa: أضف نموذجًا

source: View on site
ar_sa: استعرض على الموقع

source: View entries
ar_sa: اعرض المدخلات

source: Submit
ar_sa: أرسل

source: Add field
ar_sa: أضف حقلاً

source: No entries selected
ar_sa: لم يتم تحديد مدخلات

source: Delete selected entries?
ar_sa: احذف المدخلات المحددة؟

source: Field
ar_sa: حقل

source: Include
ar_sa: اشمل

source: Filter by
ar_sa: رشح حسب

source: All
ar_sa: الجميع

source: Back to form
ar_sa: عد للنموذج

source: Export CSV
ar_sa: صدر كملف CSV

source: Export XLS
ar_sa: صدر كملف XLS

source: Entries
ar_sa: المدخلات

source: Delete selected
ar_sa: احذف المحدد

source: No entries to display
ar_sa: ليست هناك مدخلات

source: Forms
ar_sa: النماذج

source: No forms to display.
ar_sa: ليست هناك نماذج.

source: + Add Form
ar_sa: + أضف نموذجًا

source: Title
ar_sa: العنوان

source: Status
ar_sa: الحالة

source: Send copies to
ar_sa: أرسل نسخًا إلى

source: Published from
ar_sa: منشور ابتداء من

source: Expires on
ar_sa: منشور حتى

source: Total entries
ar_sa: مجموع المدخلات

source: Edit form
ar_sa: عدل النموذج

source: Filter entries
ar_sa: رشح المدخلات

source: View all entries
ar_sa: اعرض جميع المدخلات

source: Export all entries
ar_sa: صدر جميع المدخلات
